In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from pandas.core.common import random_state
from sklearn.metrics import mean_squared_error,r2_score

In [3]:
df=pd.read_csv("multiple_linear_regression_dataset.csv")
df.head()

   age  experience  income
0   25           1   30450
1   30           3   35670
2   47           2   31580
3   32           5   40130
4   43          10   47830

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         20 non-null     int64
 1   experience  20 non-null     int64
 2   income      20 non-null     int64
dtypes: int64(3)
memory usage: 608.0 bytes

In [5]:
df.describe()

             age  experience        income
count  20.000000   20.000000     20.000000
mean   39.650000    6.200000  40735.500000
std    10.027725    4.124382   8439.797625
min    23.000000    1.000000  27840.000000
25%    31.500000    3.750000  35452.500000
50%    40.000000    5.000000  40190.000000
75%    47.000000    9.000000  45390.000000
max    58.000000   17.000000  63600.000000

In [11]:
X=df.drop("income",axis=1)
X.head()

   age  experience
0   25           1
1   30           3
2   47           2
3   32           5
4   43          10

In [13]:
y=df['income']
y.head()

0    30450
1    35670
2    31580
3    40130
4    47830
Name: income, dtype: int64

In [14]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=0)

In [15]:
model=LinearRegression()
model.fit(X_train,y_train)

LinearRegression()

In [16]:
print("intercept =",model.intercept_)
print("coefficient =",model.coef_)

intercept = 30945.793141906892
coefficient = [ -97.99352918 2205.90861907]

In [17]:
y_pred=model.predict(X_test)

In [18]:
pd.DataFrame({"Original":y_test,'pred':y_pred,"error":y_test-y_pred})

    Original          pred        error
18     44190  46487.255430 -2297.255430
1      35670  34623.713124  1046.286876
19     48700  49379.118753  -679.118753
8      40250  38349.575658  1900.424342

In [20]:
print("MSE=",mean_squared_error(y_test,y_pred))
print("R2=",r2_score(y_test,y_pred))
print("RMSE",np.sqrt(mean_squared_error(y_test,y_pred)))

MSE= 2611228.4245839915
R2= 0.8872690560355565
RMSE 1615.9295852802472